Repository: developsessions/b-r-udp-broadcast
Catalog: Automation Studio/as/system/A0453/Texts/EventLog_AR.tmx
Source language: en
Languages: de

source: CAN initialization error
de: NET2000: CAN Initialisierungsfehler

source: No memory free.
de: NET2000: Kein Speicher verfügbar

source: Hardware is not supported.
de: NET2000: Hardware wird nicht unterstützt

source: Resource handling error
de: NET2000: Fehler im Taskklassen-Handling

source: Configuration redundancy
de: NET2000: Konfiguration exisitiert bereits

source: Invalid interface description
de: NET2000: Ungültiger Device-String

source: Interface does not exist or no driver loaded
de: NET2000: Device oder Treiber existieren nicht

source: Invalid interface parameters
de: NET2000: Ungültiger Mode-String

source: NET2000 management destroyed
de: NET2000: NET2000 Management Struktur zerstört

source: Error from the NET2000 event manager.
de: NET2000: Fehler vom NET2000 Event-Manager

source: no L2 puffer
de: NET2000: Kein L2 Buffer

source: error from CAN driver
de: NET2000: Fehler vom CAN Treiber

source: L2 puffer error
de: NET2000: L2 Buffer Fehler

source: error while sending a frame
de: NET2000: Fehler beim Senden eines Frames

source: initalize error
de: NET2000: Initialisierungsfehler

source: wrong length of frame
de: NET2000: Falsche Frame-Länge

source: Standard serial layer initialization error
de: NET2000: Standard Serial Layer Initialisierungsfehler

source: NET2000 buffer management error
de: NET2000: NET2000 Buffer Management Fehler

source: Network management initialization error
de: NET2000: Netzwerk Initialisierungsfehler

source: Error copying PV
de: NET2000: Fehler beim PV kopieren

source: Incorrect access to hardware component / Not enough DRAM
de: Falscher Zugriff auf Hardwarekomponente / DRAM zu klein

source: DRAM copied: Memory already assigned, warmstart not possible
de: DRAM-Kopieren: Speicher schon belegt, Warmstart nicht möglich

source: Device is not supported
de: Device wird nicht unterstützt

source: Interface number wrong or interface not supported
de: Interface Bezeichnung falsch oder nicht unterstützt

source: Baud rate not supported
de: Baudrate wird nicht unterstützt

source: Parity not supported
de: Parity wird nicht unterstützt

source: Number of stop NITS not supported
de: Anzahl der Stopp NITS wird nicht unterstützt

source: Invalid own_ID specified in the MBSOpen() FBK; valid IDs are between 1 and 247
de: ungültige Angabe der own_ID beim FUB MBSOpen(), gültige ID's liegen zwischen 1 und 247

source: Incorrect time at timer activation
de: Falsche Zeit bei Timeraktivierung

source: Invalid ID or ID is 0
de: ungültige Ident bzw. Ident ist 0

source: ModBus simulation variable invalid or missing (MBSOpen() and MBSlave() FBK)
de: ungültige bzw. keine ModBus-Simulationsvariable vorhanden (FUB MBSOpen() und MBSlave())

source: Timer does not support interrupt
de: Timer unterstützt keinen Interrupt

source: In MBSOpen() or MBMOpen() FBKs: invalid value for timeout parameter (< 250 ms). In MBMCmd(), MBMaster() and MBSlave() FBKs: timeout detected
de: Timeout Fehler aufgetreten

source: Framedriver error 8079 (faulty receive buffer)
de: Frametreiber Fehler 8079 (Buffer war beim Empfang fehlerhaft)

source: Timer does not support this time
de: Timer unterstützt diese Zeit nicht

source: Illegal or not supported data type
de: Illegaler oder nicht unterstützter Datentyp

source: Illegal or not supported network request received
de: Illegale oder nicht unterstützte Netzwerkanfrage erhalten

source: Invalid entry in data object, invalid length of data object, or an entry is missing or has an invalid length
de: ungültiger Eintrag im Datenobjekt, ungültige Länge des Datenobjekts oder ein Eintrag fehlt bzw. hat ungültige Länge

source: Data object not present or data parameter in MBMCmd FBK is 0
de: Datenobjekt nicht vorhanden bzw. Parameter data des FUB's MBMCmd ist 0

source: Invalid EventPV specified in the data object
de: ungültige Angabe einer EventPV im Datenobjekt

source: Invalid ModBus function stated in the data object or in the MBMCmd() FBK
de: ungültige Angabe einer ModBus-Function im Datenobjekt bzw. beim FUB MBMCmd()

source: Invalid node number specified in the data object or in the MBMCmd() FBK
de: ungültige Angabe einer NodeNumber im Datenobjekt bzw. beim FUB MBMCmd()

source: Invalid LocalPV specified in the data object
de: ungültige Angabe einer LocalPV im Datenobjekt

source: Invalid length specified in the data object (ModBus function 5,6 -> length is always 1)
de: ungültige Angabe einer Länge im Datenobjekt (ModBus-Funktion 5,6 --> Länge ist immer 1)

source: No memory for internal library management
de: Kein Speicher für die interne Verwaltung der Bibliothek

source: Could not register allocated memory
de: konnte allokierten Speicher nicht registrieren

source: Memory cannot be freed for internal library management
de: Freigabe des Speichers für die interne Verwaltung der Bibliothek nicht möglich

source: Invalid frame received
de: Empfang eines ungültigen Frames

source: Frame with wrong length received
de: Empfang eines Frames mit falscher Länge

source: Error in frame
de: Fehler im Frame

source: Error in frame check (CRC / LRC) MBMaster() and MBMCmd()
de: Fehler in der Frameüberprüfung (CRC / LRC) MBMaster() und MBMCmd()

source: Error in frame check (CRC) MBMSlave()
de: Fehler in der Frameüberprüfung (CRC) MBMSlave()

source: Could not open device driver
de: konnte Devicetreiber nicht öffnen

source: Error receiving a frame (FRM_read())
de: Fehler beim Empfang eines Frames (FRM_read())

source: No write buffer available (FRM_gbuf())
de: kein Puffer zum Schreiben vorhanden (FRM_gbuf())

source: Error writing a frame (FRM_write())
de: Fehler beim Schreiben eines Frames (FRM_write())

source: Error in buffer return (FRM_robuf())
de: Fehler bei der Pufferrückgabe (FRM_robuf())

source: Error in buffer return (FRM_rbuf())
de: Fehler bei der Pufferrückgabe (FRM_rbuf())

source: Error closing the interface (FRM_close())
de: Fehler beim Schließen der Schnittstelle (FRM_close())

source: Incorrect access to hardware component (CRM)
de: Falscher Zugriff auf Hardwarekomponente (CRM)

source: The internal value of a step switching mechanism is outside the valid range.
de: Der interne Wert eines Schrittschaltwerkes befindet sich außerhalb des gültigen Bereichs.

source: The node number in the response frame from the slave is not addressed to the master (node number <> 0x10).
de: Die Knotennummer im Response-Frame des Slaves ist nicht an den Master adressiert (Knotennummer 0x10!).

source: Frame from slave contains no slave response code.
de: Frame vom Slave enthält keine Slave-Response-Kennung.

source: Response frame has not arrived within timeout time.
de: Response-Frame ist nicht innerhalb der Timeout-Zeit angekommen.

source: Error while receiving a character (overflow, stop bit, parity error, etc.)
de: Fehler beim Empfang eines Zeichens (Überlauf-, Stopp-Bit-, Paritäts-Fehler, ...)

source: Invalid index received. Bit 6 not set (0x40).
de: Ungültiger Index wurde empfangen. Bit 6 wurde nicht gesetzt (0x40).

source: Valid STX (start of text) received within a data frame. Data already received is ignored and a new frame is received.
de: Gültiger STX (Start Of Text) wurde innerhalb eines Daten-Frames empfangen. Die bereits empfangen Daten werden ignoriert, ein neuer Frame wird empfangen.

source: Data length within the frame is less than 5 characters. Valid MININET frames contain at least 5 bytes of data.
de: Datenlänge innerhalb des Frames ist weniger als 5 Zeichen. Gültige MININET-Frames enthalten mindestens 5 Byte Daten.

source: Incorrect offset for access to CRM
de: Falsches Offset bei Zugriff auf CRM

source: Frame received with an invalid block checksum.
de: Frame mit einer ungültigen Block-Prüfsumme wurde empfangen.

source: Additional data received after the checksum for the MININET frame. The frame has therefore been rejected and a new frame is awaited.
de: Nach der Checksumme des MININET-Frames wurden weitere Daten empfangen. Aus diesem Grund wird der Frame verworfen und auf einen neuen Frame gewartet.

source: The frame received is addressed to a different slave. Note: The exec output is not set if this error is reported.
de: Der empfangene Frame ist an einen anderen Slave adressiert. Hinweis: Der Ausgang exec wird nicht gesetzt, wenn dieser Fehler gemeldet wird.

source: The frame received is a slave response for the master. Note: The exec output is not set if this error is reported.
de: Der empfangene Frame ist ein Slave-Response für den Master. Hinweis: Der Ausgang exec wird nicht gesetzt, wenn dieser Fehler gemeldet wird.

source: There is no 'R' after the reset slave command in a broadcast frame.
de: Dem Befehl Reset Slave innerhalb eines Broadcast-Frames folgt kein 'R'.

source: There is no 'R' after the reset slave command in a normal frame.
de: Dem Befehl Reset Slave innerhalb eines normalen Frames folgt kein 'R'.

source: Address length of the packed writing/reading request must be 2 bytes.
de: Adresslänge des Requests gepacktes Schreiben/Lesen muss 2 Byte sein.

source: Address length of the packed writing/reading broadcast request must be 2 bytes.
de: Adresslänge des Broadcast-Requests gepacktes Schreiben/Lesen muss 2 Byte sein

source: Invalid index received.
de: Empfangener Index ist ungültig.

source: The Write counter request cannot be executed. The MNS_REG variable has not been declared.
de: Der Request Schreibe Counter kann nicht ausgeführt werden. Die Variable MNS_REG wurde nicht deklariert.

source: Incorrect length for access to CRM
de: Falsche Länge beim Zugriff auf CRM

source: The Read counter request cannot be executed. The MNS_REG variable has not been declared.
de: Der Request Lese Counter kann nicht ausgeführt werden. Die Variable MNS_REG wurde nicht deklariert.

source: The Write counter request in the incoming broadcast frame cannot be executed. The MNS_REG variable has not been declared.
de: Der Request Schreibe Counter im empfangenen Broadcast-Frame kann nicht ausgeführt werden. Die Variable MNS_REG wurde nicht deklariert.

source: The MNS_REG variable is shorter than the address and data length specified in the Write counter request.
de: Die Variable MNS_REG ist kürzer als die im Request Schreibe Counter angegebene Adresse und Datenlänge.

source: The MNS_REG variable is shorter than the address and data length specified in the Read counter request.
de: Die Variable MNS_REG ist kürzer als die im Request Lese Counter angegebene Adresse und Datenlänge.

source: The MNS_REG variable is shorter than the address and data length specified in the Write counter broadcast request.
de: Die Variable MNS_REG ist kürzer als die im Broadcast-Request Schreibe Counter angegebene Adresse und Datenlänge.

source: The Write flag request cannot be executed. The MNS_FLAG variable has not been declared.
de: Der Request Schreibe Merker kann nicht ausgeführt werden. Die Variable MNS_FLAG wurde nicht deklariert.

source: The Read flag request cannot be executed. The MNS_FLAG variable has not been declared.
de: Der Request Lese Merker kann nicht ausgeführt werden. Die Variable MNS_FLAG wurde nicht deklariert.

source: The Write flag (packed) request cannot be executed. The MNS_FLAG variable has not been declared.
de: Der Request Schreibe Merker (gepackt) kann nicht ausgeführt werden. Die Variable MNS_FLAG wurde nicht deklariert.

source: The Read flag (packed) request cannot be executed. The MNS_FLAG variable has not been declared.
de: Der Request Lese Merker (gepackt) kann nicht ausgeführt werden. Die Variable MNS_FLAG wurde nicht deklariert.

source: The Write flag broadcast request cannot be executed. The MNS_FLAG variable has not been declared.
de: Der Broadcast-Request Schreibe Merker kann nicht ausgeführt werden. Die Variable MNS_FLAG wurde nicht deklariert.

source: The Write flag (packed) broadcast request cannot be executed. The MNS_FLAG variable has not been declared.
de: Der Broadcast-Request Schreibe Merker (gepackt) kann nicht ausgeführt werden. Die Variable MNS_FLAG wurde nicht deklariert.

source: The MNS_FLAG variable is shorter than the address and data length specified in the Write flag request.
de: Die Variable MNS_FLAG ist kürzer als die im Request Schreibe Merker angegebene Adresse und Datenlänge.

source: The MNS_FLAG variable is shorter than the address and data length specified in the Read flag request.
de: Die Variable MNS_FLAG ist kürzer als die im Request Lese Merker angegebene Adresse und Datenlänge.

source: The MNS_FLAG variable is shorter than the address and data length specified in the Write flag (packed) request.
de: Die Variable MNS_FLAG ist kürzer als die im Request Schreibe Merker (gepackt) angegebene Adresse und Datenlänge.

source: The MNS_FLAG variable is shorter than the address and data length specified in the Read flag (packed) request.
de: Die Variable MNS_FLAG ist kürzer als die im Request Lese Merker (gepackt) angegebene Adresse und Datenlänge.

source: The MNS_FLAG variable is shorter than the address and data length specified in the Write flag broadcast request.
de: Die Variable MNS_FLAG ist kürzer als die im Broadcast-Request Schreibe Merker angegebene Adresse und Datenlänge.

source: The MNS_FLAG variable is shorter than the address and data length specified in the Write flag (packed) broadcast request.
de: Die Variable MNS_FLAG ist kürzer als die im Broadcast-Request Schreibe Merker (gepackt) angegebene Adresse und Datenlänge.

source: The Write input request cannot be executed. The MNS_IN variable has not been declared.
de: Der Request Schreibe Eingang kann nicht ausgeführt werden. Die Variable MNS_IN wurde nicht deklariert.

source: The Read input request cannot be executed. The MNS_IN variable has not been declared.
de: Der Request Lese Eingang kann nicht ausgeführt werden. Die Variable MNS_IN wurde nicht deklariert.

source: The Write input (packed) request cannot be executed. The MNS_IN variable has not been declared.
de: Der Request Schreibe Eingang (gepackt) kann nicht ausgeführt werden. Die Variable MNS_IN wurde nicht deklariert.

source: The Read input (packed) request cannot be executed. The MNS_IN variable has not been declared.
de: Der Request Lese Eingang (gepackt) kann nicht ausgeführt werden. Die Variable MNS_IN wurde nicht deklariert.

source: The Write input broadcast request cannot be executed. The MNS_IN variable has not been declared.
de: Der Broadcast-Request Schreibe Eingang kann nicht ausgeführt werden. Die Variable MNS_IN wurde nicht deklariert.

source: The Write input (packed) broadcast request cannot be executed. The MNS_IN variable has not been declared.
de: Der Broadcast-Request Schreibe Eingang (gepackt) kann nicht ausgeführt werden. Die Variable MNS_IN wurde nicht deklariert.

source: The MNS_IN variable is shorter than the address and data length specified in the Write input request.
de: Die Variable MNS_IN ist kürzer als die im Request Schreibe Eingang angegebene Adresse und Datenlänge.

source: The MNS_IN variable is shorter than the address and data length specified in the Read input request.
de: Die Variable MNS_IN ist kürzer als die im Request Lese Eingang angegebene Adresse und Datenlänge.

source: The MNS_IN variable is shorter than the address and data length specified in the Write input (packed) request.
de: Die Variable MNS_IN ist kürzer als die im Request Schreibe Eingang (gepackt) angegebene Adresse und Datenlänge.

source: The MNS_IN variable is shorter than the address and data length specified in the Read input (packed) request.
de: Die Variable MNS_IN ist kürzer als die im Request Lese Eingang (gepackt) angegebene Adresse und Datenlänge.

source: The MNS_IN variable is shorter than the address and data length specified in the Write input broadcast request.
de: Die Variable MNS_IN ist kürzer als die im Broadcast-Request Schreibe Eingang angegebene Adresse und Datenlänge.

source: The MNS_IN variable is shorter than the address and data length specified in the Write input (packed) broadcast request.
de: Die Variable MNS_IN ist kürzer als die im Broadcast-Request Schreibe Eingang (gepackt) angegebene Adresse und Datenlänge.

source: The Write output request cannot be executed. The MNS_OUT variable has not been declared.
de: Der Request Schreibe Ausgang kann nicht ausgeführt werden. Die Variable MNS_OUT wurde nicht deklariert.

source: The Read output request cannot be executed. The MNS_OUT variable has not been declared.
de: Der Request Lese Ausgang kann nicht ausgeführt werden. Die Variable MNS_OUT wurde nicht deklariert.

source: The Write output (packed) request cannot be executed. The MNS_OUT variable has not been declared.
de: Der Request Schreibe Ausgang (gepackt) kann nicht ausgeführt werden. Die Variable MNS_OUT wurde nicht deklariert.

source: The Read output (packed) request cannot be executed. The MNS_OUT variable has not been declared.
de: Der Request Lese Ausgang (gepackt) kann nicht ausgeführt werden. Die Variable MNS_OUT wurde nicht deklariert.

source: The Write output broadcast request cannot be executed. The MNS_OUT variable has not been declared.
de: Der Broadcast-Request Schreibe Ausgang kann nicht ausgeführt werden. Die Variable MNS_OUT wurde nicht deklariert.

source: The Write output (packed) broadcast request cannot be executed. The MNS_OUT variable has not been declared.
de: Der Broadcast-Request Schreibe Ausgang (gepackt) kann nicht ausgeführt werden. Die Variable MNS_OUT wurde nicht deklariert.

source: The MNS_OUT variable is shorter than the address and data length specified in the Write output request.
de: Die Variable MNS_OUT ist kürzer als die im Request Schreibe Ausgang angegebene Adresse und Datenlänge.

source: The MNS_OUT variable is shorter than the address and data length specified in the Read output request.
de: Die Variable MNS_OUT ist kürzer als die im Request Lese Ausgang angegebene Adresse und Datenlänge.

source: The MNS_OUT variable is shorter than the address and data length specified in the Write output (packed) request.
de: Die Variable MNS_OUT ist kürzer als die im Request Schreibe Ausgang (gepackt) angegebene Adresse und Datenlänge.

source: The MNS_OUT variable is shorter than the address and data length specified in the Read output (packed) request.
de: Die Variable MNS_OUT ist kürzer als die im Request Lese Ausgang (gepackt) angegebene Adresse und Datenlänge.

source: The MNS_OUT variable is shorter than the address and data length specified in the Write output broadcast request.
de: Die Variable MNS_OUT ist kürzer als die im Broadcast-Request Schreibe Ausgang angegebene Adresse und Datenlänge.

source: The write command in the MININET request has already been executed.
de: Der Schreib-Befehl im MININET-Request wurde bereits ausgeführt.

source: Conflict between command and index: The incoming index is the same as in the preceding frame, but this frame contains another command.
de: Konflikt zwischen Befehl und Index: Der empfangene Index ist derselbe wie im vorhergehenden Frame, aber dieser Frame enthält einen anderen Befehl.

source: Unknown command in incoming frame.
de: Unbekannter Befehl im empfangenen Frame.

source: Unknown command in incoming broadcast frame.
de: Unbekannter Befehl im empfangenen Broadcast-Frame.

source: Unknown command in incoming broadcast frame. A broadcast frame cannot contain the Read counter command.
de: Unbekannter Befehl im empfangenen Broadcast-Frame. Der Befehl Lese Counter darf nicht in einem Broadcast-Frame enthalten sein.

source: Unknown command in incoming broadcast frame. A broadcast frame cannot contain the Read flag command.
de: Unbekannter Befehl im empfangenen Broadcast-Frame. Der Befehl Lese Merker darf nicht in einem Broadcast-Frame enthalten sein.

source: Unknown command in incoming broadcast frame. A broadcast frame cannot contain the Read input command.
de: Unbekannter Befehl im empfangenen Broadcast-Frame. Der Befehl Lese Eingang darf nicht in einem Broadcast-Frame enthalten sein.

source: Unknown command in incoming broadcast frame. A broadcast frame cannot contain the Read output command.
de: Unbekannter Befehl im empfangenen Broadcast-Frame. Der Befehl Lese Ausgang darf nicht in einem Broadcast-Frame enthalten sein.

source: Unknown command in incoming broadcast frame. A broadcast frame cannot contain the Read flag (packed) command.
de: Unbekannter Befehl im empfangenen Broadcast-Frame. Der Befehl Lese Merker (gepackt) darf nicht in einem Broadcast-Frame enthalten sein.

source: Unknown command in incoming broadcast frame. A broadcast frame cannot contain the Read input (packed) command.
de: Unbekannter Befehl im empfangenen Broadcast-Frame. Der Befehl Lese Eingang (gepackt) darf nicht in einem Broadcast-Frame enthalten sein.

source: Unknown command in incoming broadcast frame. A broadcast frame cannot contain the Read output (packed) command.
de: Unbekannter Befehl im empfangenen Broadcast-Frame. Der Befehl Lese Ausgang (gepackt) darf nicht in einem Broadcast-Frame enthalten sein.

source: Invalid data type for enable flag variable (BOOL or USINT).
de: Ungültiger Datentyp der Enable-Flag-Variable (BOOL oder USINT).

source: PV length in the command data table is longer than the PV name data type.
de: PV-Länge in Befehlsdaten-Tabelle ist größer als der Datentyp von PV-Name.

source: The PV name string in the command data table consists only of spaces.
de: Der String PV-Name in der Befehlsdaten-Tabelle besteht nur aus Leerzeichen.

source: Node number in the command data table is greater than 0x7F.
de: Knotennummer in der Befehlsdaten-Tabelle ist größer als 0x7F.

source: A PV length that is not permissible in MININET frames was specified in the command data table for the Write counter command.
de: In der Befehlsdaten-Tabelle wurde für den Befehl Schreibe Counter eine PV-Länge angegeben, die in MININET-Frames nicht erlaubt ist.

source: A PV length that is not permissible in MININET frames was specified in the command data table for the Read counter command.
de: In der Befehlsdaten-Tabelle wurde für den Befehl Lese Counter eine PV-Länge angegeben, die in MININET-Frames nicht erlaubt ist.

source: A PV length that is not permissible in MININET frames was specified in the command data table for the Write flag command.
de: In der Befehlsdaten-Tabelle wurde für den Befehl Schreibe Merker eine PV-Länge angegeben, die in MININET-Frames nicht erlaubt ist.

source: A PV length that is not permissible in MININET frames was specified in the command data table for the Read flag command.
de: In der Befehlsdaten-Tabelle wurde für den Befehl Lese Merker eine PV-Länge angegeben, die in MININET-Frames nicht erlaubt ist.

source: A PV length that is not permissible in MININET frames was specified in the command data table for the Write input command.
de: In der Befehlsdaten-Tabelle wurde für den Befehl Schreibe Eingang eine PV-Länge angegeben, die in MININET-Frames nicht erlaubt ist.

source: A PV length that is not permissible in MININET frames was specified in the command data table for the Read input command.
de: In der Befehlsdaten-Tabelle wurde für den Befehl Lese Eingang eine PV-Länge angegeben, die in MININET-Frames nicht erlaubt ist.

source: A PV length that is not permissible in MININET frames was specified in the command data table for the Write output command.
de: In der Befehlsdaten-Tabelle wurde für den Befehl Schreibe Ausgang eine PV-Länge angegeben, die in MININET-Frames nicht erlaubt ist.

source: A PV length that is not permissible in MININET frames was specified in the command data table for the Read output command.
de: In der Befehlsdaten-Tabelle wurde für den Befehl Lese Ausgang eine PV-Länge angegeben, die in MININET-Frames nicht erlaubt ist.
